var isTurn = prompt("Сіз қиылысқа тап болдыңыз! " + "Қай жақа барасыз " + " оңға  " + " немесе " + "  солға")

if (isTurn == "Оңға" || isTurn == "оңға") {
    var isRiver = prompt("Сіз өзен көріп тұрсыз " + " A)Жүземін " + " әлде " + "B)Қайық жасаймын")
    if(isRiver == "A" || "a"){
        var isLand = prompt("Сіз су тасқынының кесірінен аралға тап болдыңыз,аралдан қазына сандығын таптыңыз енді оны ашасызба" + "\n" + "A) Aшaмын " + "\n" + "B)Ашпаймын")
        if(isLand == "A" || isLand == "a"){
            alert("Құттықтаймын, сіз 5$ Тауып алдыңыз!")
        } else if(isLand == "B" || isLand == "b") {
            alert("Сізді құтқарушылар келіп құтқарып алды абай болыңыз!")
        } 
    } else if(isRiver == "B" || isRiver == "b") {
        alert("Келесі бетке сәтті өттіңіз")
    }
} else if(isTurn == "солға" || isTurn == "Coлғa" ) {
    alert("Жол жөнделіп жатыр басқа жолмен жүріңіз!")
}else {
    alert("Дұрыс жауап жазыңыз!")
}